docs/1c-export-mobile/MobileAgent/DataProcessors/ЗакрытиеСтарыхЗаказов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.8">
	<DataProcessor>
		<Properties>
			<Name>ЗакрытиеСтарыхЗаказов</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Заказ</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>64</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>64</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХарактеристикаНоменклатуры</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДобавитьВЗаказ</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Заказ_уид</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура_уид</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Характеристика_уид</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Статус</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>32</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Продано</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

docs/1c-export-mobile/MobileAgent/DataProcessors/ЗакрытиеСтарыхЗаказов/Forms/Форма/Ext/Form/Module.bsl
&НаКлиенте
Процедура Заполнить(Команда)
	
	РезультатЗаполнения = ЗаполнитьНаСервере();
	Сообщить(?(ПустаяСтрока(РезультатЗаполнения), "Данные получены.", РезультатЗаполнения));
	
КонецПроцедуры

&НаСервере
Функция ЗаполнитьНаСервере()
	
	Объект.Товары.Очистить();
	
	Если Объект.Контрагент.Пустая() Тогда
		Возврат "Заполните контрагента";
	КонецЕсли;
	
	Попытка
		Прокси = СоединениеСБазой.ПолучитьПрокси();
	Исключение
		Возврат "Ошибка доступа к данным клиента" + Символы.ПС + ОписаниеОшибки();
	КонецПопытки;
	
	Попытка
		СисИнфо = Новый СистемнаяИнформация;
		КодМобильногоКомпьютера = Строка(СисИнфо.ИдентификаторКлиента);
		ПарольВхода = СокрЛП(Константы.ПарольВхода.Получить());
		Если Не ЗначениеЗаполнено(ПарольВхода) Тогда 
			Возврат "Не заповнено пароль для обміну";
		КонецЕсли;	
	Исключение
		Возврат "Ошибка доступа к данным клиента" + Символы.ПС + ОписаниеОшибки();
	КонецПопытки;
	
	Результат = Прокси.ПолучитьДанныеНезакрытыхЗаказов(ПарольВхода, Новый ХранилищеЗначения(Объект.Контрагент.УникальныйИдентификатор())).Получить();
	Если ТипЗнч(Результат) = Тип("Строка") Тогда
		Возврат Результат;
		
	ИначеЕсли ТипЗнч(Результат) = Тип("ТаблицаЗначений") Тогда
		
		Если НЕ Результат.Количество() Тогда 
			Возврат "У клієнта " + Объект.Контрагент.Наименование + " не має незакритих замовлень";
		КонецЕсли;
		
		Для Каждого СтрокаРезультат Из Результат Цикл
			СтрокаТовар = Объект.Товары.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаТовар, СтрокаРезультат, "Количество, Сумма, Заказ_уид, Номенклатура_уид");
			СтрокаТовар.Цена =  СтрокаТовар.Сумма / СтрокаТовар.Количество;
			СтрокаТовар.Заказ = Формат(СтрокаРезультат.Дата, "ДЛФ=D");
			СтрокаТовар.Номенклатура = СтрокаРезультат.НоменклатураПредставление;
			СтрокаТовар.Статус = СтрокаРезультат.СтатусЗамовлення;
			СтрокаТовар.Продано = СтрокаРезультат.Продано;

		КонецЦикла;
		Возврат "";
		
	Иначе
		Возврат "Возвращаемый тип " + Строка(ТипЗнч(Результат)) + " не подходит для выполнения операции";
		
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура ЗаказыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = Истина;
	
КонецПроцедуры

&НаСервере
Функция ЗакрытьЗаказНаСервере()
	
	Если Не Объект.Товары.Количество() Тогда
		Возврат "Не выбраны товары";
	КонецЕсли;
	
	Попытка
		Прокси = СоединениеСБазой.ПолучитьПрокси();
	Исключение
		Возврат "Ошибка доступа к данным клиента" + Символы.ПС + ОписаниеОшибки();
	КонецПопытки;
	
	Попытка
		СисИнфо = Новый СистемнаяИнформация;
		КодМобильногоКомпьютера = Строка(СисИнфо.ИдентификаторКлиента);
		ПарольВхода = СокрЛП(Константы.ПарольВхода.Получить());
		Если Не ЗначениеЗаполнено(ПарольВхода) Тогда 
			Возврат "Не заповнено пароль для обміну";
		КонецЕсли;	
	Исключение
		Возврат "Ошибка доступа к данным клиента" + Символы.ПС + ОписаниеОшибки();
	КонецПопытки;
	
	Данные = Новый ХранилищеЗначения(Объект.Товары.Выгрузить());
	
	Результат = Прокси.ЗакрытьСтарыеЗаказы(ПарольВхода, Данные, Новый ХранилищеЗначения(Объект.Контрагент.УникальныйИдентификатор()));
	
	
	ТЗДляИсторииКлиентов = Объект.Товары.Выгрузить();
	ТЗДляИсторииКлиентов.Свернуть("Заказ, Номенклатура");
	
	ТекстИстории = "Закриття заказів" + Символы.ПС + Символы.ВК + Символы.ПС + Символы.ВК;
	
	ТекстИстории = ТекстИстории + Строка(ТекущаяДата());
	ТекстИстории = ТекстИстории + Символы.ПС + Символы.ВК;
	
	Для Каждого стрТЗДляИсторииКлиентов  ИЗ ТЗДляИсторииКлиентов Цикл
		ТекстИстории =  ТекстИстории + стрТЗДляИсторииКлиентов.Заказ + "    " + стрТЗДляИсторииКлиентов.Номенклатура + Символы.ПС + Символы.ВК;
	КонецЦикла;	
	
	Менеджер = РегистрыСведений.РаботаСКлиентом.СоздатьМенеджерЗаписи();
	Менеджер.Период = ТекущаяДата();
	Менеджер.Клиент = Объект.Контрагент;
	Менеджер.Запись = ТекстИстории;
	Менеджер.УИД_Записи = Новый УникальныйИдентификатор;
	Менеджер.АвтоматичнийЗаписБезВзаємодіїЗКлієнтом = Истина;
	Менеджер.Записать();
	Общий.ОбновитьПоследнююРаботуСКлиентом(Объект.Контрагент);
	ДобавитьВЗаказ = Объект.Товары.НайтиСтроки(Новый Структура("ДобавитьВЗаказ", Истина)); 
	
	Если ДобавитьВЗаказ.Количество() = 0 Тогда 
		Возврат Результат;
	КонецЕсли;
	
	ЗаказОбъект = Документы.Заказ.СоздатьДокумент();
	ЗаказОбъект.Контрагент = Объект.Контрагент;
	ЗаказОбъект.ПризначитиПродажТорговомуКонтрагента = Истина;
	ЗаказОбъект.ВивантажуватиВ1С = Истина;
	ЗаказОбъект.Дата = ТекущаяДата();
	ЗаказОбъект.Доставка = Перечисления.НаявністьДоставки.Доставка;
	ЗаказОбъект.ТипЦен = Объект.Контрагент.ТипЦен;
	ЗаказОбъект.СкладКонтрагента = ПолучитьСкладКонтрагента(Объект.Контрагент);
	
	Для Каждого Элемент из ДобавитьВЗаказ Цикл 
		
		Строка = ЗаказОбъект.Товары.Добавить();
		Строка.Номенклатура = Справочники.Номенклатура.ПолучитьСсылку(Элемент.Номенклатура_уид);
		Строка.Количество = Элемент.Количество;
		Строка.Цена = Элемент.Цена;
		Строка.Сума = Элемент.Сумма;
		Строка.ЦенаПродажиВес = Элемент.Цена / 20;
		
	КонецЦикла;
	
	ЗаказОбъект.Записать(РежимЗаписиДокумента.Запись);
	
	
	
	Возврат ЗаказОбъект.Ссылка;
	
КонецФункции


&НаКлиенте
Процедура ЗакрытьЗаказ(Команда)
	
	РезультатЗакрытия = ЗакрытьЗаказНаСервере();
	Если ТипЗнч(РезультатЗакрытия) = Тип("ДокументСсылка.Заказ") Тогда 
		Закрыть();
		ОткрытьЗначение(РезультатЗакрытия);
		
	ИначеЕсли ПустаяСтрока(РезультатЗакрытия) Тогда
		Сообщить("Старые заказы успешно закрыты");
		Объект.Товары.Очистить();
	Иначе
		Сообщить(РезультатЗакрытия);
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	
	Объект.Товары.Очистить();
	
КонецПроцедуры


&НаКлиенте
Процедура ТоварыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = истина;
КонецПроцедуры


&НаКлиенте
Процедура ТоварыПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСкладКонтрагента(Контрагент)
	з = Новый Запрос;
	з.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	          |	СкладыКонтрагентов.Ссылка КАК Склад
	          |ИЗ
	          |	Справочник.СкладыКонтрагентов КАК СкладыКонтрагентов
	          |ГДЕ
	          |	СкладыКонтрагентов.Контрагент = &Контрагент";
	з.УстановитьПараметр("Контрагент",Контрагент);
	Выборка = З.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Склад;
	Иначе 
		Возврат Справочники.СкладыКонтрагентов.ПустаяСсылка();
	КонецЕсли;
	
КонецФункции
